##### Creating a DataFrame

In [4]:
import numpy as np
import pandas as pd

In [ ]:
# Create a dataframe from dictionary, here keys will be column header and rest willl be records
data = {
    'Name': ['Suhas', 'Aniket', 'Ritesh', 'Rohit'],
    'Age': [24,23,25,22],
    'City': ['Pune', 'Satara', 'Mumbai', 'Dhule'],
    'Salary': [12000, 23000, 45000, 12590]
}
df = pd.DataFrame(data=data)
df

     Name  Age    City  Salary
0   Suhas   24    Pune   12000
1  Aniket   23  Satara   23000
2  Ritesh   25  Mumbai   45000
3   Rohit   22   Dhule   12590

In [ ]:
# Create a dataframe using list, but here columns header will be index also since we have not provided it
data_list = [
    ['suhas',22,'Pune'],
    ['Aniket',23,'kolhapur'],
    ['Ram',45,'Mumbai']
]

df2 = pd.DataFrame(data_list)
df2

        0   1         2
0   suhas  22      Pune
1  Aniket  23  kolhapur
2     Ram  45    Mumbai

In [13]:
# Create a dataframe using list, Also pass column_name_list separately
data_list2 = [
    ['suhas',22,'Pune'],
    ['Aniket',23,'kolhapur'],
    ['Ram',45,'Mumbai']
]
column_names = ['Name','Age','PlaceOfBirth']
df3 = pd.DataFrame(data_list2, columns=column_names)
df3

     Name  Age PlaceOfBirth
0   suhas   22         Pune
1  Aniket   23     kolhapur
2     Ram   45       Mumbai